Database Files/app/controllers/sessions_controller.rb

	def create
	  @user = User.find_by_username(params[:session][:username])
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'krj221' LIMIT 1