Database Files/app/controllers/users_controller.rb

	def create
	  @user = User.new(user_params)
	  if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `username`, `password_digest`, `gender`, `phone_number`, `age`, `created_at`, `updated_at`) VALUES ('Kyle', 'Johnson', 'krj221@gmail.com', 'krj221', '$2a$10$.lioZVW8GfFg7RIdlGx8OeRSBi0EikH6bIkWZ890ARMWBdyZ4akoC', 'male', '4079242665', 24, '2017-04-29 03:26:04', '2017-04-29 03:26:04')