app/controllers/users_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Kyle', 'Johnson', 'krj221@gmail.com', '$2a$10$B1Q8w1jyXPSBs4i44A0azuABFUL/KurhCrVXnodkA7v6oAavmzMd2', '2017-04-28 03:43:24', '2017-04-28 03:43:24')
---
	def create
	  @user = User.new(user_params)
	  if @user.save